IDEA Open Model
WarningMessage Class
Compatible with IDEA StatiCa 20.1
 Open Warning message
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Message.OpenMessage
 IdeaRS.OpenModel.Message.WarningMessage
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class WarningMessage : OpenMessage
Public Class WarningMessage
	Inherits OpenMessage
The WarningMessage type exposes the following members.
Constructors
Name | Description
WarningMessage()
 Constructor
WarningMessage(MessageNumber, OpenObject, String, String, OpenMessage)
 Constructor
Top
Properties
Name | Description
Description
 Description of message
 (Inherited from OpenMessage.)
InnerMessage
 Inner message
 (Inherited from OpenMessage.)
Message
 Gets the Message
 (Overrides OpenMessage.Message.)
Number
 Number of message
 (Inherited from OpenMessage.)
Object
 Affected object
 (Inherited from OpenMessage.)
PropertyName
 Affected property name
 (Inherited from OpenMessage.)
PropertyValue
 Gets the value of affected property
 (Inherited from OpenMessage.)
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace